# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [1]:
# Your code here
import sqlite3
import pandas as pd

conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [10]:
# Your code here
cur.execute('''SELECT firstname, lastname, city, state 
                FROM employees
                LEFT JOIN offices
                ON employees.officecode
                ORDER BY firstname, lastname''')

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df

    firstName lastName           city       state
0        Andy   Fixter  San Francisco          CA
1        Andy   Fixter         Boston          MA
2        Andy   Fixter            NYC          NY
3        Andy   Fixter          Paris
4        Andy   Fixter          Tokyo  Chiyoda-Ku
..        ...      ...            ...         ...
179   Yoshimi     Kato          Paris
180   Yoshimi     Kato          Tokyo  Chiyoda-Ku
181   Yoshimi     Kato         Sydney
182   Yoshimi     Kato         London
183   Yoshimi     Kato         Boston          MA

[184 rows x 4 columns]

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [11]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
                FROM customers
                LEFT JOIN orders
                ON orders.orderNumber''')

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

  contactFirstName contactLastName  orderNumber   orderDate   status
0          Carine          Schmitt        10100  2003-01-06  Shipped
1          Carine          Schmitt        10101  2003-01-09  Shipped
2          Carine          Schmitt        10102  2003-01-10  Shipped
3          Carine          Schmitt        10103  2003-01-29  Shipped
4          Carine          Schmitt        10104  2003-01-31  Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [14]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, amount, paymentDate
                FROM customers
                LEFT JOIN payments
                ON payments.customerNumber
                ORDER BY amount DESC''')



df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

  contactFirstName contactLastName     amount paymentDate
0          Carine          Schmitt  120166.58  2005-03-18
1             Jean            King  120166.58  2005-03-18
2            Peter        Ferguson  120166.58  2005-03-18
3          Janine          Labrune  120166.58  2005-03-18
4           Jonas       Bergulfsen  120166.58  2005-03-18

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [ ]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, productName, quantityOrdered, orderDate
                FROM customers
                LEFT JOIN orders
                ON customers.customerNumber
                LEFT JOIN orderdetails
                ON orderdetails.orderNumber
                LEFT JOIN products
                ON products.productCode
                ORDER BY orderDate DESC''')

df = pd.DataFrame(cur.fetchall()) 
df.columns = [i[0] for i in cur.description]
df.head()

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!